src/mock/paymentsreceived.mock.json

[
    {
        "CustomerName": "Ryder",
        "CustomerCode": "RSLC",
        "InvoiceCount": 3,
        "PaidAmount": 100,
        "ReferenceNumber": 265740565,
        "PaidBy": "Alita",
        "PaidDate": "2023/10/07",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Error",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/10/07"
    },
    {
        "CustomerName": "Penske",
        "CustomerCode": "RSLC",
        "InvoiceCount": 4,
        "PaidAmount": 600,
        "ReferenceNumber": 2657489,
        "PaidDate": "2023/10/06",
        "PaidBy": "Alita",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Sucess",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/10/06"
    },
    {
        "CustomerName": "Penske",
        "CustomerCode": "RSLC",
        "InvoiceCount": 6,
        "PaidDate": "2023/10/06",
        "PaidAmount": 500,
        "ReferenceNumber": 2679751595,
        "PaidBy": "Alita",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Sucess",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/10/06"
    },
    {
        "CustomerName": "Flexfleet",
        "CustomerCode": "RSLC",
        "InvoiceCount": 1,
        "PaidDate": "2023/10/05",
        "PaidAmount": 200,
        "ReferenceNumber": 254653157,
        "PaidBy": "Alita",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Sucess",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/10/05"
    },
    {
        "CustomerName": "Ryder",
        "CustomerCode": "RSLC",
        "InvoiceCount": 5,
        "PaidDate": "2023/10/04",
        "PaidAmount": 800,
        "ReferenceNumber": 2002200,
        "PaidBy": "Alita",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Sucess",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/10/04"
    },
    {
        "CustomerName": "Fleetworthy",
        "CustomerCode": "RSLC",
        "InvoiceCount": 3,
        "PaidDate": "2023/09/28",
        "PaidAmount": 700,
        "ReferenceNumber": 220039568992,
        "PaidBy": "Alita",
        "CurrencyCode": "USD",
        "PaymentMethodID": "Check",
        "PaymentConfirmation": "Sucess",
        "BankAccountID": "600002200",
        "BankDepositedDate": "2023/09/28"
    }
]